app/views/portfolios/show.html.erb


<%= @portfolio_items.technologies.each do |t| %>
---
SELECT "technologies".* FROM "technologies" WHERE "technologies"."portfolio_id" = $1  [["portfolio_id", 11]]