app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
    def index
        @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "subtitle", "body", "main_image", "thumb_image", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        @portfolio_items = Portfolio.new(params.require(:portfolio).permit(:title, :subtitle, :body,
            technologies_attributes: [:name]
        ))
        respond_to do |format|
            if @portfolio_items.save

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
        @portfolio_items = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "portfolios" SET "title" = $1, "subtitle" = $2, "updated_at" = $3 WHERE "portfolios"."id" = $4  [["title", "Portfolio title: HaiLT"], ["subtitle", "My great services Demo"], ["updated_at", "2018-06-14 17:43:47.052126"], ["id", 5]]
---
    def update
        @portfolio_items = Portfolio.find(params[:id])
        respond_to do |format|
            if @portfolio_items.update(params.require(:portfolio).permit(:title, :subtitle, :body))

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def show
        @portfolio_items = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 5]]
---
    def destroy
        #Perform the lookup
        @portfolio_items = Portfolio.find(params[:id])

        #Destroy/Delete the record
        @portfolio_items.destroy